# CategorySetIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategorySetIterator Class
Members See Also
---
An iterator to a category set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CategorySetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CategorySetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CategorySetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CategorySetIterator
# See Also
CategorySetIterator Members
Autodesk.Revit.DB Namespace